bit-finance/Reports/бит_ПроизвольныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ПроизвольныйОтчет</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборВОтчете</Name>
					<Comment>Отбор в отчете</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Comment>Режим расшифровки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Comment>Язык</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартныйПериод</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПримечания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаПараметры</Name>
					<Comment>Таблица параметры</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаДанныеОтчета</Name>
					<Comment>Таблица данные отчета</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс отчета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность отчета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Comment>Настройка пула подключений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбластиРасшифровки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/InformationRegisters/бит_ОписаниеОтчетовДляИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ОписаниеОтчетовДляИИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ФорматыВыгрузкиОтчетовВИИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_ВидыПараметровЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыПараметровЗапроса</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
					<Comment>Список</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
					<Comment>Выражение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ТипыПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыПроизвольныхОтчетов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйОтчет</Name>
					<Comment>Произвольный отчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьМСФО</Name>
					<Comment>Отчетность МСФО</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_ПоказателиПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПоказателиПроизвольныхОтчетов</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_НастройкиПроизвольныхОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЯчейки</Name>
					<Comment>Вид ячейки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЯчеекПроизвольногоОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементДанных</Name>
					<Comment>Элемент данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьДвиженияПоБюджету</Name>
					<Comment>Формировать движения по бюджету</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДанных</Name>
					<Comment>Период данных</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаТаблицыОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ЭлементыТаблицПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаТаблицыОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ЭлементыТаблицПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличественныйУчет</Name>
					<Comment>0 - суммовой, 1  - количественный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПоУмолчанию</Name>
					<Comment>Значения по умолчанию</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Comment>Имя аналитики</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Comment>Аналитика</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Comment>Значение аналитики</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аргументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аргумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоказателиПроизвольныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/бит_СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СохраненныеНастройки</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНастройки</Name>
					<Comment>Тип настройки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыСохраненныхНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Comment>Ключ объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемыйОбъект</Name>
					<Comment>Настраиваемый объект</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНастройки</Name>
					<Comment>Ключ настройки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Reports/бит_ПроизвольныйОтчет/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем мТекущийВидПараметра; // Служит для передачи вида параметра между обработчиками.

&НаКлиенте
Перем СоответствиеРезультатов; // Хранит соответствие результатов формирования отчета.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере(Отказ);
	бит_ИскусственныйИнтеллект.ДобавитьКомандыВзаимодействия(ЭтотОбъект, Элементы.ПодменюОтправить);
															
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СформироватьПриОткрытии Тогда
		ПодключитьОбработчикОжидания("ОжиданиеЗавершенияОткрытияФормы", 0.5, Истина); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "АктивизироватьОбласть" И Источник = УникальныйИдентификатор Тогда
		АктивизироватьОбласть(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменениеПериода" И Параметр = УникальныйИдентификатор Тогда
		ИзмененыНастройки = Истина;
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.Результат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры // РезультатПриАктивизацииОбласти()

&НаКлиенте
Процедура РезультатПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Если Область.СодержитЗначение 
		 И ТипЗнч(Область.Значение) = Тип("Число") Тогда
		 
		ИзменениеСодержимогоОбласти(Область.Имя,Область.Значение);
			
	КонецЕсли;
	
КонецПроцедуры // РезультатПриИзмененииСодержимогоОбласти()

&НаКлиенте
Процедура НастройкаПулаПодключенийПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ИзменениеВалютыСервер();
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтчетаПриИзменении(Элемент)
	
	НастройкаОтчетаПриИзмененииНаСервере();
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЯзыкПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматЧиселПриИзменении(Элемент)
	
	бит_МеханизмПолученияДанныхВызовСервера.УстановитьФорматВывода(
		Отчет.НастройкаОтчета, Результат, Отчет.ФорматЧисел, Отчет.Язык);
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматЧиселНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	КонструктовФормата = Новый КонструкторФорматнойСтроки(Отчет.ФорматЧисел);
	
	КонструктовФормата.ДоступныеТипы = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2));
	
	ДопПараметры = Новый Структура("КонструктовФормата", КонструктовФормата);
	ОбработчикКФ = Новый ОписаниеОповещения("КонструктовФорматаОткрытьЗавершение", ЭтотОбъект, ДопПараметры);
	КонструктовФормата.Показать(ОбработчикКФ);
		
КонецПроцедуры

// Обработчик завершения редактирования форматной строки.
//  См. Синтакс-помощник: КонструкторФорматнойСтроки.Показать().
//
&НаКлиенте
Процедура КонструктовФорматаОткрытьЗавершение(НастройкиФормата, ДопПараметры) Экспорт
	
	Если НастройкиФормата <> Неопределено Тогда
		Отчет.ФорматЧисел = ДопПараметры.КонструктовФормата.Текст;
		бит_МеханизмПолученияДанныхВызовСервера.УстановитьФорматВывода(Отчет.НастройкаОтчета, 
			Результат, Отчет.ФорматЧисел, Отчет.Язык);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияОднаДатаПриИзменении(Элемент)
	
	ОпределитьДатуНачалаДляМСФО();
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьЗаголовокОрганизации(ЭтотОбъект);
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект, Элемент, Отчет, "Организация",
		СписокТиповОрганизация,СтандартнаяОбработка);
													   
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьПримечанияПриИзменении(Элемент)
	
	ВыполнитьУдалениеПримечаний();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборВОтчете

&НаКлиенте
Процедура ОтборВОтчетеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ОтборВОтчете.ТекущиеДанные;	
	
	Если ТекущаяСтрока.Значение = Неопределено Тогда
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	Иначе	
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Ложь;
	КонецЕсли;
	
	Если НЕ НоваяСтрока Тогда
		бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ОтборВОтчетеЗначение, 
			ТекущаяСтрока.ВидСравнения);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеВидСравненияПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеЗначениеПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПараметры

&НаКлиенте
Процедура ТаблицаПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	 	
	
	Если НоваяСтрока И НЕ Копирование Тогда  		
		ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение");   			
	КонецЕсли; 
	
	мТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
	
	ОграничитьОписаниеТиповПараметра();
	
КонецПроцедуры // ТаблицаПараметрыПриНачалеРедактирования()

&НаКлиенте
Процедура ТаблицаПараметрыВидПараметраПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ИД = Элементы.ТаблицаПараметры.ТекущиеДанные.ПолучитьИдентификатор();
		ИзменитьВидПараметра(ИД, мТекущийВидПараметра);
		
		мТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
		
		ОграничитьОписаниеТиповПараметра();
				
	КонецЕсли;
	
КонецПроцедуры // ТаблицаПараметрыВидПараметраПриИзменении()

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные        = Элементы.ТаблицаПараметры.ТекущиеДанные;	
	мТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
	
	Если мТекущийВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда  		
		СтандартнаяОбработка = Ложь;			
	КонецЕсли;
	
КонецПроцедуры // ТаблицаПараметрыЗначениеПараметраНачалоВыбора()

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение") Тогда		
		Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина;
	КонецЕсли;
	
КонецПроцедуры // ТаблицаПараметрыЗначениеПараметраОчистка()

&НаКлиенте
Процедура ТаблицаПараметрыПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
		
	СкрытьНастройки();
	ОчиститьСообщения();
	НачатьФормированиеОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериода(Отчет, "СтандартныйПериод", , УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКопиюРезультата(Команда)
	
	бит_ОтчетыКлиент.ПоказатьКопиюРезультата(Результат);	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметры(Команда)
	
	Если Отчет.ТаблицаПараметры.Количество() > 0 Тогда
		ОбработкаОповещения = Новый ОписаниеОповещения("ОбновитьПараметрыЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Продолжить?'; 
						|en = 'The tabular part will be cleared before filling in. Continue?'");
		ПоказатьВопрос(ОбработкаОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбновитьТаблицуПараметров();
	КонецЕсли; 
		
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ОбновитьПараметрыЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда    		
		ОбновитьТаблицуПараметров();   		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборы(Команда)
	
	Если ЗначениеЗаполнено(Отчет.ОтборВОтчете) Тогда
		ОбработкаОповещения = Новый ОписаниеОповещения("ОбновитьОтборыЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Продолжить?'; 
						|en = 'The tabular part will be cleared before filling in. Continue?'");
		ПоказатьВопрос(ОбработкаОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьОтборВОтчете();
	КонецЕсли; 
		
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ОбновитьОтборыЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда    		
		ЗаполнитьОтборВОтчете();   		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПримечания(Команда)
	
	ВыполнитьУдалениеПримечаний();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЭкземпляр(Команда)
	
	// Упакуем объект в структуру.
	ПараметрыОтчета = ПараметрыПроизвольногоОтчета(); 
	
	// Создадим параметры формы.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыОтчета", ПараметрыОтчета);
	
	ОткрытьФорму("Справочник.бит_ЭкземплярыОтчетов.ФормаОбъекта",ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифроватьЯчейку(Команда)
	
	ОткрытьФормуРасшифровки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифроватьВсе(Команда)
	
	ОткрытьФормуРасшифровки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифроватьОтчетом(Команда)
	
	РасшифроватьОтчетом();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьРасшифровки(Команда)
	
	бит_ПолучениеДанныхКлиент.ЗакрытьРасшифровки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
	Элементы.Сформировать.КнопкаПоУмолчанию = Истина;
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариант(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	
	Оповещение = Новый ОписаниеОповещения("СохранитьВариантЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьВариантЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		УстановитьЗаголовок(Результат, ЭтотОбъект);
		СохранитьВариантЗавершениеНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВариант(Команда)
						
	ПараметрыФормы = ПараметрыХраненияНастроек();
	Оповещение	   = Новый ОписаниеОповещения("ВыбратьВариантЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте 
Процедура ВыбратьВариантЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;	
	
	ВыбратьВариантЗавершениеНаСервере("", Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыбратьВариант(Команда)

	ВыбратьВариантЗавершениеНаСервере(Команда.Имя, Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьЭталонТабличногоДокумента(Команда)
	
	#Если ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Тогда
		Результат.Записать(ИмяФайлаТабличногоДокумента(Истина));
	#Иначе	
		ПоказатьПредупреждение(, НСтр("ru='Сравнение файлов возможно только в толстом клиенте'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьСЭталономТабличныйДокумент(Команда)

	#Если ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Тогда
		Результат.Записать(ИмяФайлаТабличногоДокумента(Ложь));
		СравнениеФайлов = Новый СравнениеФайлов;
		СравнениеФайлов.ПервыйФайл = ИмяФайлаТабличногоДокумента(Истина);
		СравнениеФайлов.ВторойФайл = ИмяФайлаТабличногоДокумента(Ложь);
		СравнениеФайлов.СпособСравнения = СпособСравненияФайлов.ТабличныйДокумент;
		СравнениеФайлов.ПоказатьРазличия();
	#Иначе
		ПоказатьПредупреждение(, НСтр("ru='Сравнение файлов возможно только в толстом клиенте'"));
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СтандартныеНастройки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Отчет.НастройкаОтчета) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "Заполнение",НСтр("ru = 'Настройка'; en = 'adjustment'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "НастройкаОтчета", "Отчет");
		Возврат;
	КонецЕсли;
	
	НастройкаОтчетаПриИзмененииНаСервере();
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыСнятьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Отчет.ОтборВОтчете, "Использование", 0, Элементы.ОтборВОтчете);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыУстановитьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Отчет.ОтборВОтчете, "Использование", 1, Элементы.ОтборВОтчете);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчет(Команда)

	Контекст = Новый Структура;
	Контекст.Вставить("ИндексФорматовСохраненияОтчета", Новый Соответствие);

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = ДоступныеФорматыСохраненияОтчета(Контекст.ИндексФорматовСохраненияОтчета);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = НСтр("ru = 'Сохранение результата отчета'");

	Обработчик = Новый ОписаниеОповещения("СохранитьОтчетПослеВыбораИмениФайла", ЭтотОбъект, Контекст);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Обработчик, Диалог);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	
	ПоказатьДиалогОтправкиПоПочте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	ЭтоОтчетМСФО = (Форма.ТипОтчета = ПредопределенноеЗначение("Перечисление.бит_ТипыПроизвольныхОтчетов.ОтчетностьМСФО"));
	Элементы	 = Форма.Элементы;
	
	Элементы.Организация.Видимость		  = ЭтоОтчетМСФО;
	Элементы.ГруппаПериодНаДату.Видимость = ЭтоОтчетМСФО;
	Элементы.ГруппаПериод.Видимость       = НЕ ЭтоОтчетМСФО;
	
	УстановитьЗаголовокОрганизации(Форма);

КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	СуммаОтчета = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		СуммаОтчета, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

// Процедура выполняет активизацию области табличного документа.
// 
// Параметры:
//  ИмяОбласти - Строка.
// 
&НаКлиенте
Процедура АктивизироватьОбласть(ИмяОбласти)

	Обл = Результат.Области.Найти(ИмяОбласти);
	
	Если НЕ Обл = Неопределено Тогда
		
		Элементы.Результат.ТекущаяОбласть = Обл;
			
	КонецЕсли; 

КонецПроцедуры

// Процедура ограничивает описание типов в строке таблица параметров.
// 
&НаКлиенте
Процедура ОграничитьОписаниеТиповПараметра()

	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если мТекущийВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда
			
		ОписаниеОграничение = Строка500;
		
	Иначе
		
		Если ТекущиеДанные.ЗначениеПараметра = Неопределено Тогда  		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина; 		
		Иначе	                                                        		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Ложь;  		
		КонецЕсли; 
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СписокЗначений"));
		Если ЗначениеЗаполнено(ТекущиеДанные.ДоступныеТипы) Тогда
			ОписаниеОграничение = Новый ОписаниеТипов(ТекущиеДанные.ДоступныеТипы, МассивТипов);
		Иначе		
			ОписаниеОграничение = Новый ОписаниеТипов(СсылкиИБазовыеТипы, МассивТипов);
		КонецЕсли;
		
	КонецЕсли;	
	
	// Ограничим тип значения
	Элементы.ТаблицаПараметрыЗначениеПараметра.ОграничениеТипа = ОписаниеОграничение;  

КонецПроцедуры // ОграничитьОписаниеТиповПараметра()

// Процедура открывает форму расшифровки.
// 
// Параметры:
//  ОткрытьВсе - Булево.
// 
&НаКлиенте
Процедура ОткрытьФормуРасшифровки(ОткрытьВсе = Ложь)
	
	ТекущаяОбласть = Элементы.Результат.ТекущаяОбласть;
	Если ТипЗнч(ТекущаяОбласть) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИмяОбласти",				ТекущаяОбласть.Имя);
		ПараметрыФормы.Вставить("НастройкаОтчета",			Отчет.НастройкаОтчета);
		ПараметрыФормы.Вставить("ДатаНачала",				Отчет.СтандартныйПериод.ДатаНачала);
		ПараметрыФормы.Вставить("ДатаОкончания",			Отчет.СтандартныйПериод.ДатаОкончания);
		ПараметрыФормы.Вставить("ФорматЧисел",				Отчет.ФорматЧисел);
		ПараметрыФормы.Вставить("ОткрытьВсе",				ОткрытьВсе);
		ПараметрыФормы.Вставить("ВалютаДокумента",			Отчет.ВалютаДокумента);
		ПараметрыФормы.Вставить("КурсДокумента",			Отчет.КурсДокумента);
		ПараметрыФормы.Вставить("КратностьДокумента",		Отчет.КратностьДокумента);
		ПараметрыФормы.Вставить("Организация",				Отчет.Организация);
		ПараметрыФормы.Вставить("ИмяФормыВладельца" ,		ИмяФормы);
		ПараметрыФормы.Вставить("НастройкаПулаПодключений", Отчет.НастройкаПулаПодключений);		
		
		УпаковатьТаблицы(ПараметрыФормы);
		
		КлючУникальностиФормы = ?(ОткрытьВсе, Строка(Отчет.НастройкаОтчета), ТекущаяОбласть.Имя);
		ОткрытьФорму("Обработка.бит_РасшифровкаПроизвольногоОтчета.Форма", ПараметрыФормы, ЭтаФорма, КлючУникальностиФормы);
	КонецЕсли;
	
КонецПроцедуры

// Процедура открывает отчет-расшифровку.
// 
&НаКлиенте
Процедура РасшифроватьОтчетом()

	ТекущаяОбласть = Элементы.Результат.ТекущаяОбласть;
	Если ТипЗнч(ТекущаяОбласть) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИмяОбласти"     	 , ТекущаяОбласть.Имя);
		ПараметрыФормы.Вставить("НастройкаОтчета"	 , Отчет.НастройкаОтчета);
		ПараметрыФормы.Вставить("ДатаНачала"     	 , Отчет.СтандартныйПериод.ДатаНачала);
		ПараметрыФормы.Вставить("ДатаОкончания"  	 , Отчет.СтандартныйПериод.ДатаОкончания);
		ПараметрыФормы.Вставить("ФорматЧисел"    	 , Отчет.ФорматЧисел);
		ПараметрыФормы.Вставить("ВалютаДокумента"	 , Отчет.ВалютаДокумента);
		ПараметрыФормы.Вставить("КурсДокумента"  	 , Отчет.КурсДокумента);
		ПараметрыФормы.Вставить("КратностьДокумента", Отчет.КратностьДокумента);
		ПараметрыФормы.Вставить("Организация"       , Отчет.Организация);
		ПараметрыФормы.Вставить("Язык"              , Отчет.Язык);
		ПараметрыФормы.Вставить("РежимРасшифровки"  , Истина);
		
		УпаковатьТаблицы(ПараметрыФормы);		
		
		ОткрытьФорму("Отчет.бит_ПроизвольныйОтчет.Форма", ПараметрыФормы, ЭтотОбъект, Строка(ТекущаяОбласть.Имя));
	Иначе
		
		ТекстСообщения = НСтр("ru='Не выбрана ячейка для которой следует вывести расшифровку.';
							  |en='Cell which should be interpreted isn’t selected'");		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереВРежимеРасшифровки(Отказ)
		
	Перем ОтчетРасшифровка;
		
	ПоказательОтчета = Справочники.бит_ПоказателиПроизвольныхОтчетов.НайтиПоКоду(Отчет.ИмяОбластиРасшифровки,,,Отчет.НастройкаОтчета);
	
	Если ЗначениеЗаполнено(ПоказательОтчета) Тогда
		ОтчетРасшифровка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПоказательОтчета, "ЭлементДанных.ОтчетРасшифровка");
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ОтчетРасшифровка) Тогда
		ТекстСообщения = НСтр("ru='Для ячейки %1 расшифровка отчетом не предусмотрена.';
							  |en='For cell %1 transcript by report is not available.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения,Отчет.ИмяОбластиРасшифровки);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	
		
	Отчет.НастройкаОтчета = ОтчетРасшифровка;
	РеквизитыНастройки	  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.НастройкаОтчета,
							"ФорматЧисел, Язык, СпособКомпоновки, ТипОтчета");
		
	ТипОтчета = РеквизитыНастройки.ТипОтчета;
	
	// Восстановим отбор из элемента данных.
	ОтборВОтчете	 = Отчет.ОтборВОтчете.Выгрузить();
	ОтборСохраненный = ПоказательОтчета.ЭлементДанных.ХранилищеОтборВОтчете.Получить();
	Если ТипЗнч(ОтборСохраненный) = Тип("ТаблицаЗначений") Тогда
		ОтборВОтчете = ОтборСохраненный;
	Иначе
		СпособКомпоновки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтчетРасшифровка, "СпособКомпоновки");
		бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(СпособКомпоновки, ОтборВОтчете); 
	КонецЕсли; 
	
	Если Параметры.Свойство("ОтборВОтчете") Тогда
		// Копируем отбор из отчета
		КопияОтборВОтчете = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(Параметры.ОтборВОтчете);
		Если ТипЗнч(КопияОтборВОтчете) = Тип("ТаблицаЗначений") Тогда
			
			Для каждого СтрокаТаблицы Из КопияОтборВОтчете Цикл
				// Настройка расшифровки имеет более высокий приоритет, чем переданные параметры.
				СтрокаОтбора = ОтборВОтчете.Найти(СтрокаТаблицы.Имя,"Имя");
				Если СтрокаОтбора <> Неопределено Тогда
					Если НЕ СтрокаОтбора.Использование Тогда
						ЗаполнитьЗначенияСвойств(СтрокаОтбора,СтрокаТаблицы);
					КонецЕсли; 
				Иначе	
					НоваяСтрока = ОтборВОтчете.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	Отчет.ОтборВОтчете.Загрузить(ОтборВОтчете);
	
	ТаблицаПараметры = Отчет.ТаблицаПараметры.Выгрузить();
	Если Параметры.Свойство("ТаблицаПараметры") Тогда
		// Копируем параметры из отчета
		КопияТаблицаПараметры = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(Параметры.ТаблицаПараметры);
		Если ТипЗнч(КопияТаблицаПараметры) = Тип("ТаблицаЗначений") Тогда
			Для каждого СтрокаТаблицы Из КопияТаблицаПараметры Цикл
				НоваяСтрока = ТаблицаПараметры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	Отчет.ТаблицаПараметры.Загрузить(ТаблицаПараметры);
	
	УстановитьЗаголовок("", ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
	СформироватьПриОткрытии = Истина;

КонецПроцедуры

&НаСервере
Процедура УпаковатьТаблицы(ПараметрыПередачи)
	
	ПараметрыПередачи.Вставить("ТаблицаДанныеОтчета", 
		бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(Отчет.ТаблицаДанныеОтчета.Выгрузить()));
	
	ПараметрыПередачи.Вставить("ОтборВОтчете", 
		бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(Отчет.ОтборВОтчете.Выгрузить()));
	
	ПараметрыПередачи.Вставить("ТаблицаПараметры", 
		бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(Отчет.ТаблицаПараметры.Выгрузить()));
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокОрганизации(Форма)

	Отчет 	 = Форма.Отчет;
	Элементы = Форма.Элементы;
	
	Если Отчет.Организация = Неопределено Тогда
		Элементы.Организация.Заголовок = НСтр("ru='Организация/Периметр';en='Organization/Perimeter'");
	ИначеЕсли ТипЗнч(Отчет.Организация) = Тип("СправочникСсылка.Организации") Тогда
		Элементы.Организация.Заголовок = НСтр("ru='Организация';en='Organization'");
	Иначе	
		Элементы.Организация.Заголовок = НСтр("ru='Периметр';en='Perimeter'");
	КонецЕсли;
		
КонецПроцедуры

// Процедура обрабатывает изменение валюты. Выполняется получение курса/кратности.
// 
&НаСервере
Процедура ИзменениеВалютыСервер()

	КурсыВалют = бит_КурсыВалют.ПолучитьКурсВалюты(Отчет.ВалютаДокумента,Отчет.ДатаОкончания);
	
	Отчет.КурсДокумента      = КурсыВалют.Курс;
	Отчет.КратностьДокумента = КурсыВалют.Кратность;

КонецПроцедуры

&НаСервере
Процедура НастройкаОтчетаПриИзмененииНаСервере()
	
	ТипОтчета = Неопределено;
	
	Отчет.ОтборВОтчете.Очистить();
	Отчет.ТаблицаПараметры.Очистить();
	Отчет.ТаблицаДанныеОтчета.Очистить();

	РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.НастройкаОтчета,
							"ФорматЧисел, Язык, СпособКомпоновки, ТипОтчета");
	
	ЗаполнитьЗначенияСвойств(Отчет, РеквизитыНастройки);
	
	ТипОтчета = РеквизитыНастройки.ТипОтчета;
	
	КопияОтборВОтчете 	  = Отчет.ОтборВОтчете.Выгрузить();
	КопияТаблицаПараметры = Отчет.ТаблицаПараметры.Выгрузить();
	
	бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(РеквизитыНастройки.СпособКомпоновки, КопияОтборВОтчете);
	бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(РеквизитыНастройки.СпособКомпоновки, КопияТаблицаПараметры, Истина);
	
	Отчет.ОтборВОтчете.Загрузить(КопияОтборВОтчете);
	Отчет.ТаблицаПараметры.Загрузить(КопияТаблицаПараметры);
	
	УстановитьЗаголовок("", ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьУдалениеПримечаний()
	
	Для каждого Область Из Результат.Области Цикл
		Область.Примечание.Текст = "";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьДатуНачалаДляМСФО()
	
	Отчет.СтандартныйПериод.ДатаНачала = бит_МеханизмПолученияДанныхКлиентСервер.ОпределитьДатуНачалаДляМСФО(
											ТипОтчета, Отчет.СтандартныйПериод.ДатаНачала, 
											Отчет.СтандартныйПериод.ДатаОкончания);
	
КонецПроцедуры

&НаСервере
Процедура ОтборВОтчетеВидСравненияПриИзмененииСервер(Ид)
		
	ТекущиеДанные = Отчет.ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);	

	бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ОтборВОтчетеЗначение, 
		ТекущиеДанные.ВидСравнения);

КонецПроцедуры

&НаСервере
Процедура ОтборВОтчетеЗначениеПриИзмененииСервер(Ид)
	
	ТекущиеДанные = Отчет.ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ОтборВОтчетеЗначениеПриИзменении(ТекущиеДанные);
		
КонецПроцедуры // ОтборВОтчетеЗначениеПриИзменении()

&НаСервере
Процедура ИзменитьВидПараметра(ИД, мТекущийВидПараметра)

	ТекущиеДанные = Отчет.ТаблицаПараметры.НайтиПоИдентификатору(ИД);
	бит_МеханизмПолученияДанных.ИзменениеВидаПараметра(ТекущиеДанные, мТекущийВидПараметра);

КонецПроцедуры // ИзменитьВидПараметра()

&НаСервере
Процедура ИзменениеСодержимогоОбласти(ИмяОбласти,ТекЗначение)
	
	СтрОтбор = Новый Структура("ИмяОбласти",ИмяОбласти); 
	
	МассивСтрок = Отчет.ТаблицаДанныеОтчета.НайтиСтроки(СтрОтбор);
	
	НовоеЗначение = ТекЗначение;
	
	// Есть строки данных, соответствующие на данной области.
	Если МассивСтрок.Количество()>0 Тогда
		
		Если ТекЗначение = 0 Тогда
			// Удаляем данные
			Для каждого Элемент Из МассивСтрок Цикл
				Отчет.ТаблицаДанныеОтчета.Удалить(Элемент);
			КонецЦикла; 
		Иначе	
			
			// Пропорционально изменяем данные
			ИтСумма = 0;
			
			Для каждого СтрокаТаблицы Из МассивСтрок Цикл
				ИтСумма = ИтСумма+СтрокаТаблицы.ЗначениеПоказателя;
			КонецЦикла; 
			
			ИтСуммаНов = 0;
			
			Для каждого СтрокаТаблицы Из МассивСтрок Цикл
				Коэфф = ?(ИтСумма <> 0, СтрокаТаблицы.ЗначениеПоказателя/ИтСумма, 0);
				
				СтрокаТаблицы.ЗначениеПоказателя  = НовоеЗначение * Коэфф;
				СтрокаТаблицы.РучнаяКорректировка = Истина;				
				
				ИтСуммаНов = ИтСуммаНов + СтрокаТаблицы.ЗначениеПоказателя;
			КонецЦикла; 
			
			Дельта = НовоеЗначение-ИтСуммаНов;
			
			Если Дельта <> 0 Тогда
				СтрокаТаблицы.ЗначениеПоказателя  = СтрокаТаблицы.ЗначениеПоказателя+Дельта;
				СтрокаТаблицы.РучнаяКорректировка = Истина;
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		
		// В таблице данных нет строк данных, соответствующих данной области.
		НоваяСтрока = Отчет.ТаблицаДанныеОтчета.Добавить();
		НоваяСтрока.ЗначениеПоказателя  = ТекЗначение;
		НоваяСтрока.РучнаяКорректировка = Истина;
		
		ЗаполнитьНовуюСтроку(НоваяСтрока.ПолучитьИдентификатор(),ИмяОбласти);
		
	КонецЕсли; 
	
	бит_МеханизмПолученияДанных.ВыполнитьРасчет(Отчет.НастройкаОтчета,Результат,Отчет.ТаблицаДанныеОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовуюСтроку(ИдСтроки,ИмяОбласти)
	
	ТекущаяСтрока = Отчет.ТаблицаДанныеОтчета.НайтиПоИдентификатору(ИдСтроки);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		
		бит_МеханизмПолученияДанных.ЗаполнитьНовуюСтрокуТаблицыДанных(ТекущаяСтрока
		                                                                , ИмяОбласти
																		, Отчет.ТаблицаДанныеОтчета
																		, Отчет.НастройкаОтчета
																		, Отчет.ФорматЧисел
																		, Отчет.Язык);
		
		// Заполнение значений по-умолчанию
		ЗначенияПоУмолчанию = Новый Структура;
		Для каждого КиЗ Из ЗначенияПоУмолчанию Цикл
			ИмяАналитики = КиЗ.Ключ;
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока[ИмяАналитики]) Тогда
				ТекущаяСтрока[ИмяАналитики] = КиЗ.Значение;
			КонецЕсли; 
		КонецЦикла; // Заполнение значений по-умолчанию
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьНовуюСтроку()

&НаКлиенте
Процедура НачатьФормированиеОтчета()

	Отказ = Ложь;
	
	ПериодЗаполненПравильно = бит_ОбщегоНазначенияКлиентСервер.ВременнойИнтервалКорректный(
								Отчет.СтандартныйПериод.ДатаНачала, Отчет.СтандартныйПериод.ДатаОкончания);
								
	Если НЕ ПериодЗаполненПравильно Тогда
		Отказ = Истина;	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Отчет.НастройкаОтчета) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "Заполнение", НСтр("ru = 'Настройка'; en = 'adjustment'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "НастройкаОтчета", "Отчет", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыНастройки = Ложь;
	ОбработатьИзменениеНастроек(ЭтотОбъект);

	ДлительнаяОперация = ЗапуститьОтложенноеФормированиеОтчета();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет формирование отчета...'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтложенноеФормированиеОтчетаЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗапуститьОтложенноеФормированиеОтчета()
		
	НаименованиеЗадания = НСтр("ru = 'Формирование произвольного отчета.'; en = 'Generating a Custom report'");
	ВыполняемыйМетод	= "Отчеты.бит_ПроизвольныйОтчет.РезультатФормированияОтчета";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ПараметрыЗаполнения = Отчеты.бит_ПроизвольныйОтчет.НовыеПараметрыФормированияОтчета();
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Отчет);
	
	ПараметрыЗаполнения.ОтборВОтчете 		= Отчет.ОтборВОтчете.Выгрузить();
	ПараметрыЗаполнения.ТаблицаПараметры	= Отчет.ТаблицаПараметры.Выгрузить();
	ПараметрыЗаполнения.ТаблицаДанныеОтчета = Отчет.ТаблицаДанныеОтчета.Выгрузить();
	ПараметрыЗаполнения.ДатаНачала			= Отчет.СтандартныйПериод.ДатаНачала;
	ПараметрыЗаполнения.ДатаОкончания		= Отчет.СтандартныйПериод.ДатаОкончания;
	ПараметрыЗаполнения.Результат			= Результат;
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						ПараметрыЗаполнения);
						
	Возврат ФоновоеЗадание;

КонецФункции

&НаКлиенте
Процедура ОтложенноеФормированиеОтчетаЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении, по причине: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, РезультатВыполнения.КраткоеПредставлениеОшибки));
	Иначе	
		ОтложенноеФормированиеОтчетаЗавершениеНаСервере(РезультатВыполнения.АдресРезультата);
	КонецЕсли; 
	
	Для каждого Сообщение Из РезультатВыполнения.Сообщения Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение.Текст, Сообщение.КлючДанных);		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ОтложенноеФормированиеОтчетаЗавершениеНаСервере(АдресРезультата)

	РезультатФормирования = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Результат = РезультатФормирования.Результат;
	Отчет.ТаблицаДанныеОтчета.Загрузить(РезультатФормирования.ДанныеОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПараметров()
	
	ИзмененыНастройки = Истина;	
	СпособКомпоновки  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.НастройкаОтчета, "СпособКомпоновки");
	
	бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(СпособКомпоновки, 
		Отчет.ТаблицаПараметры, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборВОтчете()
	
	ИзмененыНастройки = Истина;	
	СпособКомпоновки  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.НастройкаОтчета, "СпособКомпоновки");
	КопияОтборВОтчете = Отчет.ОтборВОтчете.Выгрузить();
	
	бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(СпособКомпоновки, КопияОтборВОтчете);	
	Отчет.ОтборВОтчете.Загрузить(КопияОтборВОтчете);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПроизвольногоОтчета()
	
	ПараметрыОтчета = Новый Структура;
	
	Для Каждого МетаРеквизит Из Метаданные.Отчеты.бит_ПроизвольныйОтчет.Реквизиты Цикл	
		 ПараметрыОтчета.Вставить(МетаРеквизит.Имя,Отчет[МетаРеквизит.Имя]);	
	КонецЦикла;
	
	// Для СтандартногоПериода необходимо передавать представление.
	ПараметрыОтчета.СтандартныйПериод = бит_ОбщегоНазначенияКлиентСервер.ИмяВариантаСтандартногоПериода(Отчет.СтандартныйПериод.Вариант);
	
	// Упакуем ТабличныйДокумент Результат
	ТД = Новый ТабличныйДокумент;
	ТД.ФиксацияСверху = Результат.ФиксацияСверху;
	ТД.ФиксацияСлева  = Результат.ФиксацияСлева;
	ТД.Вывести(Результат);
	
	ПараметрыОтчета.Вставить("ТабДокРезультат", ТД);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаСервере
Функция СохраняемыеНастройки()

	СохраняемыеНастройки = Отчеты.бит_ПроизвольныйОтчет.НовыеСохраняемыеНастройки();
	ЗаполнитьЗначенияСвойств(СохраняемыеНастройки, Отчет);
	
	НастройкаПериода = Отчет.СтандартныйПериод.Вариант;
	Если НастройкаПериода = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		НастройкаПериода = ВариантСтандартногоПериода.ЭтотГод;
	КонецЕсли;
	
	СохраняемыеНастройки.ВариантПериода   = НастройкаПериода;
	СохраняемыеНастройки.ОтборВОтчете	  = Новый ХранилищеЗначения(Отчет.ОтборВОтчете.Выгрузить(), Новый СжатиеДанных(9));
	СохраняемыеНастройки.ТаблицаПараметры = Новый ХранилищеЗначения(Отчет.ТаблицаПараметры.Выгрузить(), Новый СжатиеДанных(9)); 
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

&НаСервере
Процедура ПрименитьНастройки(ВариантОтчета)

	ШаблонНастроек 		 = Отчеты.бит_ПроизвольныйОтчет.НовыеСохраняемыеНастройки();
	ТипОтчета 	 		 = Неопределено;
	КлючТекущегоВарианта = "";
	
	Если ЗначениеЗаполнено(ВариантОтчета) Тогда
		
		РеквизитыВарианта 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВариантОтчета, "ХранилищеНастроек, КлючНастройки");
		СохраненныеНастройки = РеквизитыВарианта.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ШаблонНастроек, СохраненныеНастройки);
		КонецЕсли; 
		КлючТекущегоВарианта = КлючВарианта(РеквизитыВарианта.КлючНастройки);	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Отчет, ШаблонНастроек,, "ОтборВОтчете, ТаблицаПараметры");
	
	Отчет.СтандартныйПериод = Новый СтандартныйПериод(ШаблонНастроек.ВариантПериода);
	
	Отчет.ОтборВОтчете.Очистить();
	Отчет.ТаблицаПараметры.Очистить();
	Отчет.ТаблицаДанныеОтчета.Очистить();
	
	КопияОтборВОтчете = ШаблонНастроек.ОтборВОтчете.Получить();
	Если ТипЗнч(КопияОтборВОтчете) = Тип("ТаблицаЗначений") Тогда
		Отчет.ОтборВОтчете.Загрузить(КопияОтборВОтчете);
	КонецЕсли;
	
	КопияПараметры = ШаблонНастроек.ТаблицаПараметры.Получить();
	Если ТипЗнч(КопияПараметры) = Тип("ТаблицаЗначений") Тогда
		Отчет.ТаблицаПараметры.Загрузить(КопияПараметры);
	КонецЕсли;	

	Если ЗначениеЗаполнено(Отчет.НастройкаОтчета) Тогда
		
		РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.НастройкаОтчета, "ТипОтчета, СпособКомпоновки");
		ТипОтчета		   = РеквизитыНастройки.ТипОтчета;
		
		// Уточним состав таблиц настройки отчета.
		КопияОтборВОтчете 	  = Отчет.ОтборВОтчете.Выгрузить();
		КопияТаблицаПараметры = Отчет.ТаблицаПараметры.Выгрузить();
		
		бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(РеквизитыНастройки.СпособКомпоновки, КопияОтборВОтчете);
		бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(РеквизитыНастройки.СпособКомпоновки, КопияТаблицаПараметры, Ложь);
		
		Для каждого СтрокаТаблицы Из КопияОтборВОтчете Цикл
			ПараметрыПоиска = Новый Структура("Имя", СтрокаТаблицы.Имя);
			РезультатПоиска = Отчет.ОтборВОтчете.НайтиСтроки(ПараметрыПоиска);
			Если НЕ ЗначениеЗаполнено(РезультатПоиска) Тогда
				ЗаполнитьЗначенияСвойств(Отчет.ОтборВОтчете.Добавить(), СтрокаТаблицы);			
			КонецЕсли;	
		КонецЦикла; 
		
		Для каждого СтрокаТаблицы Из КопияТаблицаПараметры Цикл
			ПараметрыПоиска = Новый Структура("ИмяПараметра", СтрокаТаблицы.ИмяПараметра);
			РезультатПоиска = Отчет.ТаблицаПараметры.НайтиСтроки(ПараметрыПоиска);
			Если НЕ ЗначениеЗаполнено(РезультатПоиска) Тогда
				ЗаполнитьЗначенияСвойств(Отчет.ТаблицаПараметры.Добавить(), СтрокаТаблицы);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	УстановитьЗаголовок(ВариантОтчета, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОтчета.ТекущаяСтраница	 	  = Элементы.НастройкиОтчета;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()
	
	Элементы.РазделыОтчета.ТекущаяСтраница = Элементы.Отчет;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(Отказ)
			
	КлючТекущегоВарианта	  = "";
	СсылкиИБазовыеТипы = бит_ОбщегоНазначения.ОписаниеПроизвольногоТипа();
	Строка500		  		  = ОбщегоНазначения.ОписаниеТипаСтрока(500);
	
	СписокТиповОрганизация.Добавить(Тип("СправочникСсылка.Организации"));
	Если Метаданные.Справочники.Найти("бит_му_ПериметрыКонсолидации") <> Неопределено Тогда
		СписокТиповОрганизация.Добавить(Тип("СправочникСсылка.бит_му_ПериметрыКонсолидации"), 
										НСтр("ru='Периметры консолидации';en='Perimeter (IFRS)'"));	
	КонецЕсли;	

	ВидыСравнения = бит_МеханизмПолученияДанных.СформироватьСписокВыбораДляОтборовВОтчете();
	Для каждого Элемент Из ВидыСравнения Цикл
		ЗаполнитьЗначенияСвойств(Элементы.ОтборВОтчетеВидСравнения.СписокВыбора.Добавить(), Элемент);	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.НастройкаОтчета) Тогда
		
		Отчет.ВалютаДокумента		= Параметры.ВалютаДокумента;
		Отчет.ДатаНачала			= Параметры.ДатаНачала;
		Отчет.ДатаОкончания 		= Параметры.ДатаОкончания;
		Отчет.ИмяОбластиРасшифровки = Параметры.ИмяОбласти;
		Отчет.КурсДокумента			= Параметры.КурсДокумента;
		Отчет.КратностьДокумента	= Параметры.КратностьДокумента;
		Отчет.НастройкаОтчета		= Параметры.НастройкаОтчета;
		Отчет.Организация			= Параметры.Организация;
		Отчет.РежимРасшифровки		= Параметры.РежимРасшифровки;
		Отчет.ФорматЧисел			= Параметры.ФорматЧисел;
		Отчет.Язык					= Параметры.Язык;
		
		Если ЗначениеЗаполнено(Отчет.ДатаНачала) Тогда		
			Отчет.СтандартныйПериод.ДатаНачала    = Отчет.ДатаНачала;		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отчет.ДатаОкончания) Тогда		
			Отчет.СтандартныйПериод.ДатаОкончания = КонецДня(Отчет.ДатаОкончания);		
		КонецЕсли;
		
		Если Отчет.РежимРасшифровки Тогда
			ПриСозданииНаСервереВРежимеРасшифровки(Отказ);
		Иначе
			НастройкаОтчетаПриИзмененииНаСервере();
			
			ОбновитьМенюВариантовОтчета();
			ИзмененыНастройки = Истина;
			ОбработатьИзменениеНастроек(ЭтотОбъект);
		КонецЕсли; 
		
	Иначе
				
		ВариантПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
		ПрименитьНастройки(ВариантПоУмолчанию);
		
		ОбновитьМенюВариантовОтчета();
		ИзмененыНастройки = Истина;
		ОбработатьИзменениеНастроек(ЭтотОбъект);

	КонецЕсли;	
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки",		  ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Отчеты"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Отчет.бит_ПроизвольныйОтчет_СКД";

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНастроек(Форма)

	Состояние = ?(Форма.ИзмененыНастройки, "Неактуальность", "НеИспользовать");
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Форма.Элементы.Результат, Состояние);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовок(ВариантОтчета, Форма)

	Отчет = Форма.Отчет;	
	
	Если ЗначениеЗаполнено(Отчет.НастройкаОтчета) Тогда
		Заголовок = Строка(Отчет.НастройкаОтчета) + " %1";
	Иначе	
		Заголовок = НСтр("ru = 'Произвольный отчет %1'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВариантОтчета) Тогда
		Заголовок = СтрШаблон(Заголовок, "(" + Строка(ВариантОтчета) + ")");
	Иначе	
		Заголовок = СтрШаблон(Заголовок, "");
	КонецЕсли;
	
	Если Отчет.РежимРасшифровки Тогда
		Заголовок = Заголовок + " " + НСтр("ru = '(Расшифровка)'; en = '(Decoding)'");
	КонецЕсли;
	
	Форма.Заголовок = Заголовок;

КонецПроцедуры

&НаСервере
Процедура ВыбратьВариантЗавершениеНаСервере(ИмяКоманды, ВариантОтчета)

	Перем РезультатПоиска;
	
	Если ЗначениеЗаполнено(ИмяКоманды) Тогда
		РезультатПоиска = КомандыВариантовОтчета.НайтиСтроки(Новый Структура("ИмяКоманды", ИмяКоманды));
	Иначе	
		РезультатПоиска = КомандыВариантовОтчета.НайтиСтроки(Новый Структура("ВариантОтчета", ВариантОтчета));	
	КонецЕсли;
	
	Если РезультатПоиска = Неопределено Тогда
		ОбновитьМенюВариантовОтчета();
		ВыбратьВариантЗавершениеНаСервере(ИмяКоманды, ВариантОтчета)
	КонецЕсли;
	
	ПрименитьНастройки(РезультатПоиска[0].ВариантОтчета);
	УправлениеФормой(ЭтотОбъект);
	ПометитьТекущийВариант(ЭтотОбъект, РезультатПоиска[0].ИмяКоманды);
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ОбновитьМенюВариантовОтчета()

	Индекс = Элементы.ГруппаВариантыОтчета.ПодчиненныеЭлементы.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Кнопка = Элементы.ГруппаВариантыОтчета.ПодчиненныеЭлементы.Получить(Индекс);
		Элементы.Удалить(Кнопка);	
		Индекс = Индекс - 1;
	КонецЦикла;
	
	ВариантыОтчета = бит_ОтчетыСервер.ПроверитьДоступностьВариантовНастроек(НастраиваемыйОбъект(), Ложь);
	
	МассивИсключений   		   = ВариантыОтчета.МассивИсключений;
	МассивДоступныхНастроек    = ВариантыОтчета.МассивДоступныхНастроек;
		     	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбщийКлюч"  			   		, НастраиваемыйОбъект());
	Запрос.УстановитьПараметр("МассивИсключений"			, МассивИсключений);
	Запрос.УстановитьПараметр("МассивДоступныхНастроек"		, МассивДоступныхНастроек);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СохраненныеНастройки.Наименование КАК Наименование,
	|	бит_СохраненныеНастройки.КлючОбъекта КАК КлючОбъекта,
	|	бит_СохраненныеНастройки.КлючНастройки КАК КлючНастройки,
	|	бит_СохраненныеНастройки.Ссылка КАК Ссылка,
	|	бит_СохраненныеНастройки.ИспользоватьПриОткрытии КАК ИспользоватьПриОткрытии
	|ИЗ
	|	Справочник.бит_СохраненныеНастройки КАК бит_СохраненныеНастройки
	|ГДЕ
	|	бит_СохраненныеНастройки.КлючОбъекта ПОДОБНО &ОбщийКлюч
	|	И НЕ бит_СохраненныеНастройки.КлючНастройки В (&МассивИсключений)
	|	И (НЕ бит_СохраненныеНастройки.КлючОбъекта В (&МассивИсключений)
	|			ИЛИ бит_СохраненныеНастройки.КлючНастройки В (&МассивДоступныхНастроек))
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_СохраненныеНастройки.КлючОбъекта,
	|	бит_СохраненныеНастройки.Наименование";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
			
	Пока Выборка.Следующий() Цикл
		
		КлючВарианта	= КлючВарианта(Выборка.КлючНастройки);
		ИмяКоманды 		= СтрШаблон("Подключаемый_ВыбратьВариант%1", КлючВарианта);
		ТекущаяКоманда  = Команды.Найти(ИмяКоманды);
		
		Если ТекущаяКоманда = Неопределено Тогда
			ТекущаяКоманда = Команды.Добавить(ИмяКоманды);
			ТекущаяКоманда.Действие  = "Подключаемый_ВыбратьВариант";
			ТекущаяКоманда.Заголовок = Выборка.Наименование;
			
			НоваяСтрока = КомандыВариантовОтчета.Добавить();
			НоваяСтрока.КлючВарианта  = КлючВарианта;
			НоваяСтрока.ИмяКоманды	  = ИмяКоманды;
			НоваяСтрока.ВариантОтчета = Выборка.Ссылка;
		КонецЕсли;
		
		НоваяКнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ГруппаВариантыОтчета);
		НоваяКнопка.ИмяКоманды = ИмяКоманды;
		НоваяКнопка.Заголовок  = ТекущаяКоманда.Заголовок;
		НоваяКнопка.Пометка	   = (КлючТекущегоВарианта = КлючВарианта);				
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция КлючВарианта(КлючНастройки)

	Возврат СтрЗаменить(КлючНастройки, "-", "_");

КонецФункции

&НаСервере
Процедура СохранитьВариантЗавершениеНаСервере(ВариантОтчета)

	РеквизитыНастройки 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВариантОтчета, "ХранилищеНастроек, КлючНастройки");
	КлючТекущегоВарианта = КлючВарианта(РеквизитыНастройки.КлючНастройки);	

	ОбновитьМенюВариантовОтчета();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПометитьТекущийВариант(Форма, ИмяКоманды)

	Элементы = Форма.Элементы;
	Для каждого Элемент Из Элементы.ГруппаВариантыОтчета.ПодчиненныеЭлементы Цикл
		Элемент.Пометка = (Элемент.ИмяКоманды = ИмяКоманды);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяФайлаТабличногоДокумента(Эталон)
	
#Если ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Тогда
	
	ИмяФайла = ?(ПустаяСтрока(Заголовок), УникальныйИдентификатор, Заголовок);
	
	Если Эталон Тогда
		ИмяФайла = ИмяФайла + " " + НСтр("ru = '(Эталон)'") + ".xml";
	Иначе	
		ИмяФайла = ИмяФайла + ".xml";
	КонецЕсли;

	Возврат КаталогВременныхФайлов() + ИмяФайла;
	
#КонецЕсли

КонецФункции

&НаКлиенте
Процедура ОжиданиеЗавершенияОткрытияФормы()

	НачатьФормированиеОтчета();

КонецПроцедуры

#Область СохранениеРезультатаОтчета

&НаКлиенте
Процедура СохранитьОтчетПослеСохраненияРезультатаОтчета(Результат, ПолноеИмяФайлаОтчета) Экспорт

	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;

	Обработчик = Новый ОписаниеОповещения("СохранитьОтчетПриВыбореИмениФайлаОтчета", ЭтотОбъект, ПолноеИмяФайлаОтчета);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Отчет сохранен в файл'"), Обработчик, ПолноеИмяФайлаОтчета);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчетПриВыбореИмениФайлаОтчета(ПолноеИмяФайлаОтчета) Экспорт

	ФайловаяСистемаКлиент.ОткрытьФайл(ПолноеИмяФайлаОтчета);

КонецПроцедуры

&НаКлиенте
Функция ФорматыСохраненияОтчета(Знач ПолноеИмяФайлаОтчета, ИндексФорматовСохраненияОтчета)

	ОписаниеПолногоИмениФайла = СтрРазделить(ПолноеИмяФайлаОтчета, ПолучитьРазделительПути());
	ИмяФайлаОтчета = ОписаниеПолногоИмениФайла[ОписаниеПолногоИмениФайла.ВГраница()];

	ОписаниеИмениФайла = СтрРазделить(ИмяФайлаОтчета, ".");
	РасширениеФайлаОтчета = ОписаниеИмениФайла[ОписаниеИмениФайла.ВГраница()];

	Возврат ИндексФорматовСохраненияОтчета[РасширениеФайлаОтчета];

КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеФорматыСохраненияОтчета(ИндексФорматовСохраненияОтчета)

	ДоступныеФорматы = Новый Массив;

	ФорматыСохранения = СтандартныеПодсистемыСервер.НастройкиФорматовСохраненияТабличногоДокумента();

	ФорматСохраненияTXT = ФорматыСохранения.Найти(ТипФайлаТабличногоДокумента.TXT, "ТипФайлаТабличногоДокумента");
	ФорматСохраненияANSITXT = ФорматыСохранения.Найти(ТипФайлаТабличногоДокумента.ANSITXT,
		"ТипФайлаТабличногоДокумента");

	Если ФорматСохраненияTXT <> Неопределено И ФорматСохраненияANSITXT <> Неопределено Тогда
		ФорматыСохранения.Удалить(ФорматСохраненияANSITXT);
	КонецЕсли;

	ТекущийФорматСохранения = Новый Массив;

	Для Каждого ФорматСохранения Из ФорматыСохранения Цикл

		РасширениеФорматаСохранения = "*." + ФорматСохранения.Расширение;
		ПредставлениеФорматаСохранения = СтрЗаменить(ФорматСохранения.Представление, "." + ФорматСохранения.Расширение,
			РасширениеФорматаСохранения);

		ТекущийФорматСохранения.Добавить(ПредставлениеФорматаСохранения);
		ТекущийФорматСохранения.Добавить(РасширениеФорматаСохранения);

		ДоступныеФорматы.Добавить(СтрСоединить(ТекущийФорматСохранения, "|"));

		ТекущийФорматСохранения.Очистить();

		ИндексФорматовСохраненияОтчета.Вставить(ФорматСохранения.Расширение,
			ФорматСохранения.ТипФайлаТабличногоДокумента);

	КонецЦикла;

	Возврат СтрСоединить(ДоступныеФорматы, "|");

КонецФункции

&НаСервереБезКонтекста
Функция СписокДоступныхФорматовСохраненияОтчета(ИндексФорматовСохраненияОтчета)

	ДоступныеФорматы = Новый СписокЗначений;

	ФорматыСохранения = СтандартныеПодсистемыСервер.НастройкиФорматовСохраненияТабличногоДокумента();

	Для Каждого ФорматСохранения Из ИндексФорматовСохраненияОтчета Цикл
		НайденноеОписание = ФорматыСохранения.Найти(ФорматСохранения.Ключ, "Расширение");
		ДоступныеФорматы.Добавить(НайденноеОписание.Расширение, НайденноеОписание.Представление,,
			НайденноеОписание.Картинка);
	КонецЦикла;

	Возврат ДоступныеФорматы;

КонецФункции

&НаКлиенте
Процедура СохранитьОтчетПослеВыбораИмениФайла(РезультатВыбора, Контекст) Экспорт

	Если ТипЗнч(РезультатВыбора) = Тип("Массив") И РезультатВыбора.Количество() > 0 Тогда
		ПолноеИмяФайлаОтчета = РезультатВыбора[0];
	ИначеЕсли ТипЗнч(РезультатВыбора) = Тип("Строка") Тогда
		ПолноеИмяФайлаОтчета = РезультатВыбора;
	Иначе
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПолноеИмяФайлаОтчета) Тогда
		Контекст.Вставить("ПолноеИмяФайлаОтчета", ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(
			Заголовок));
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораФорматаСохранения", ЭтотОбъект, Контекст);
		СписокФорматов = СписокДоступныхФорматовСохраненияОтчета(Контекст.ИндексФорматовСохраненияОтчета);
		ФорматПоУмолчанию = СписокФорматов.НайтиПоЗначению("mxl");
		СписокФорматов.ПоказатьВыборЭлемента(ОписаниеОповещенияОЗакрытии, НСтр("ru='Выберите формат сохранения'"),
			ФорматПоУмолчанию);
	Иначе
		Контекст.Вставить("ПолноеИмяФайлаОтчета", ПолноеИмяФайлаОтчета);
		ВыбранныйЭлемент = Новый Структура("Значение");
		ПослеВыбораФорматаСохранения(ВыбранныйЭлемент, Контекст);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФорматаСохранения(ВыбранныйЭлемент, Контекст) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПолноеИмяФайлаОтчета = Контекст.ПолноеИмяФайлаОтчета;
	Если ВыбранныйЭлемент.Значение <> Неопределено Тогда
		ПолноеИмяФайлаОтчета = ПолноеИмяФайлаОтчета + "." + ВыбранныйЭлемент.Значение;
	КонецЕсли;

	Обработчик = Новый ОписаниеОповещения("СохранитьОтчетПослеСохраненияРезультатаОтчета", ЭтотОбъект,
		ПолноеИмяФайлаОтчета);

	ФорматыСохранения = ФорматыСохраненияОтчета(ПолноеИмяФайлаОтчета, Контекст.ИндексФорматовСохраненияОтчета);
	РезультатОтчета = СкопироватьТабличныйДокумент(Результат);
	РезультатОтчета.НачатьЗапись(Обработчик, ПолноеИмяФайлаОтчета, ФорматыСохранения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СкопироватьТабличныйДокумент(ТабличныйДокумент)

	ПотокВПамяти = Новый ПотокВПамяти;
	ТабличныйДокумент.Записать(ПотокВПамяти);
	ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);

	Результат = Новый ТабличныйДокумент;
	Результат.Прочитать(ПотокВПамяти, СпособЧтенияЗначенийТабличногоДокумента.Значение);

	Возврат Результат;

КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПоказатьДиалогОтправкиПоПочте()
	
	РезультатОтчета = СкопироватьТабличныйДокумент(Результат);
	
	Вложение = Новый Структура;
	Вложение.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(РезультатОтчета,
		УникальныйИдентификатор));
	Вложение.Вставить("Представление", Заголовок);

	СписокВложений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение);

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"РаботаСПочтовымиСообщениямиКлиент");
		ПараметрыОтправки = МодульРаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
		ПараметрыОтправки.Тема = Заголовок;
		ПараметрыОтправки.Вложения = СписокВложений;
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура бит_Подключаемый_ДобавитьОписаниеОтчетаДляИИ(Команда)
	
	ОповещениеОДобавленииОписания = Новый ОписаниеОповещения("бит_ОповещениеОДобавленииОписанияОтчетаДляИИ", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.бит_ОписаниеОтчетовДляИИ.ФормаЗаписи", бит_ПараметрыОписанияОтчетаДляИИ(),,,,,
		ОповещениеОДобавленииОписания);
	
КонецПроцедуры
	
&НаСервере
Функция бит_ПараметрыОписанияОтчетаДляИИ()

	ЗначенияЗаполнения = Новый Структура;
	
	ПолноеИмяОтчета = РеквизитФормыВЗначение("Отчет").Метаданные().ПолноеИмя();
	ЗначенияЗаполнения.Вставить("Отчет",
		Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ПолноеИмяОтчета));
	ЗначенияЗаполнения.Вставить("ВариантОтчета", Заголовок);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ОтчетТабличныйДокумент", Результат);
	
	Возврат ПараметрыФормы;
	
КонецФункции	
	
&НаКлиенте
Процедура бит_ОповещениеОДобавленииОписанияОтчетаДляИИ(Результат, ДополнительныеПараметры) Экспорт
	
	бит_ОповещениеОДобавленииОписанияОтчетаДляИИНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура бит_ОповещениеОДобавленииОписанияОтчетаДляИИНаСервере()
	
	бит_ИскусственныйИнтеллект.ДобавитьКомандыОбсужденияВариантовСИИ(ЭтотОбъект, Элементы.ПодменюОтправить);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_Подключаемый_ОбсудитьСИИ(Команда)

	бит_ИскусственныйИнтеллектКлиентСервер.ОбсудитьОтчетСИИ(ЭтотОбъект, Команда, Результат, Заголовок);
	
КонецПроцедуры

#КонецОбласти
